tap "homebrew/core"
tap "homebrew/bundle"
tap "caskroom/cask"

# Editors
cask "visual-studio-code"
# cask "sublime-text"
cask "pycharm"

# Terminal
cask "iterm2"

# Shell
brew "fish"

# Languages
# brew "python3"
# brew "node"
# brew "go"
brew "pyenv"
brew "pyenv-virtualenv"


# Tools
brew "curl"
brew "wget"
brew "ack"
brew "git-flow"
brew "p7zip"
# cask "vlc"
cask "meld"
brew "pre-commit"
# cask "flux"
brew "tmux"
brew "unrar"
brew "exa"


# Browsers
# cask "google-chrome"
cask "firefox"
cask  "brave-browser"
# cask "torbrowser"

# Cloud CLI
# cask "google-cloud-sdk"
# brew "awscli"
# brew "firebase-cli"

# Database
# brew "rethinkdb"
# brew "mongodb"
# brew "postgresql"
# brew "mysql"
# cask "dbeaver-community"

# Optional
cask "slack"
# cask "lastpass"
