tap "caskroom/cask"

# Editors
cask "visual-studio-code"
cask "sublime-text"

# Terminal
cask "iterm2"

# Shell
brew "fish"

# Languages
brew "python3"
brew "node"

# Tools
cask "flux"

# Paid Tools
cask "lastpass"

# Command Line Tools
brew "ack"
brew "git-flow"
brew "p7zip"
brew "wget"
cask "vlc"
cask "meld"
brew "pre-commit"

# Browsers
cask "google-chrome"
cask "firefox"
cask "torbrowser"

# Cloud CLI
cask "google-cloud-sdk"
brew "firebase-cli"
brew "awscli"

# Database
# brew "rethinkdb"
# brew "mongodb"
brew "postgresql"
brew "mysql"
cask "dbeaver-community"

# Optional
cask "slack"
